#Область ОбработчикиПодписокНаСобытия

// Процедура-обработчик события "ПриЗаписи" ссылочных типов данных 
// для механизма отправки объектов в узлы
// с настройкой событийной передачи данных
//
// Параметры:
//  ИмяПланаОбмена – Строка – имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - источник события, кроме типа ДокументОбъект
//  Отказ          - Булево - флаг отказа от выполнения обработчика
// 
Процедура СинхронизацияДанныхЧерезУниверсальныйФорматПриЗаписи(Источник, Отказ) Экспорт
	Если Не exch_ОбменДаннымиПроверки.ВыполнятьОбменПоСобытию(Источник, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСервер.exch_ВыгрузитьОбъект(Источник, Отказ);
КонецПроцедуры

// Процедура-обработчик события "ПриЗаписи" регистров (кроме регистров расчета)
// для механизма отправки объектов на узлах
// с настройкой событийной передачи данных
//
// Параметры:
//  ИмяПланаОбмена – Строка – имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - НаборЗаписейРегистра - источник события
//  Отказ          - Булево - флаг отказа от выполнения обработчика
//  Замещение      - Булево - признак замещения существующего набора записей
// 
Процедура СинхронизацияДанныхЧерезУниверсальныйФормат0ПриЗаписиРегистра(Источник, Отказ, Замещение) Экспорт
	Если Не exch_ОбменДаннымиПроверки.ВыполнятьОбменПоСобытию(Источник, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСервер.exch_ВыгрузитьОбъект(Источник, Отказ);
КонецПроцедуры

//образец обработчика для регистра расчета
//Процедура ПодпискаНаСобытие1ПриЗаписи1(Источник, Отказ, Замещение, ТолькоЗапись, ЗаписьФактическогоПериодаДействия, ЗаписьПерерасчетов) Экспорт
//	// Вставить содержимое обработчика.
//КонецПроцедуры

// Процедура-обработчик события "ПередУдалением" ссылочных типов данных для механизма регистрации объектов на узлах
//
// Параметры:
//  ИмяПланаОбмена – Строка – имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - источник события
//  Отказ          - Булево - флаг отказа от выполнения обработчика
// 
Процедура СинхронизацияДанныхЧерезУниверсальныйФорматПередУдалением(Источник, Отказ) Экспорт
	Если Не exch_ОбменДаннымиПроверки.ВыполнятьОбменПоСобытию(Источник, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСервер.exch_ВыгрузитьОбъект(Источник, Отказ);
КонецПроцедуры

#EndRegion