Функция КлючНастроек() Экспорт
	Возврат exch_ОбменДаннымиПовтИсп.КлючНастроек();
КонецФункции

Функция СтруктураНастроек() Экспорт
	Возврат exch_ОбменДаннымиПовтИсп.СтруктураНастроек();
КонецФункции

Функция Настройки() Экспорт
	Возврат exch_ОбменДаннымиПовтИсп.Настройки();
КонецФункции

Процедура СохранитьНастройки(настройки) Экспорт
	ключ = КлючНастроек();
	ХранилищеОбщихНастроек.Сохранить(
			ключ,
			ключ,
			настройки,
			Неопределено,
			""
	);	
КонецПроцедуры

Функция ИмяСвойстваУзлыПолучателиСобытия() Экспорт
	Возврат "exch_ПолучателиСобытияОбмена";
КонецФункции