&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	СохранитьНастройки();
	Закрыть();
КонецПроцедуры 

&НаКлиенте
Процедура Записать(Команда)
	СохранитьНастройки();
КонецПроцедуры  

&НаКлиенте
Процедура Обновить(Команда)
	ПрочитатьНастройки();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройки()
	настройки = exch_ОбменДаннымиНастройки.Настройки();
	
	Узлы.Очистить();
	Для Каждого элт Из настройки.Узлы Цикл
		стр = Узлы.Добавить();
		стр.Узел = элт.Ключ;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	настройки = exch_ОбменДаннымиНастройки.СтруктураНастроек();
	
	Для Каждого стр Из Узлы Цикл
		настройки.Узлы.Вставить(стр.Узел, стр.Узел);
	КонецЦикла;
	
	exch_ОбменДаннымиНастройки.СохранитьНастройки(настройки);
КонецПроцедуры