#Область РаботаСНастройками

Функция КлючНастроек() Экспорт
	Возврат "202003051648НастройкиАтомарногоОбмена";
КонецФункции

Функция СтруктураНастроек() Экспорт
	настройки = Новый Структура;
	
	//соответствие узлов, для которых включена атомарная выгрузка
	//ключ и значение = узел
	//в дальнейшем возможно хранение настроек каждого узла в своей структуре
	//например обработка транспорта сообщения
	Узлы = Новый Соответствие;
	настройки.Вставить("Узлы", Узлы);	
	
	Возврат настройки;
КонецФункции

Функция Настройки() Экспорт
	ключ = КлючНастроек();
	значение = ХранилищеОбщихНастроек.Загрузить(
			ключ,
			ключ,
			Неопределено,
			""
	);
		
	настройки = СтруктураНастроек();
	Если ЗначениеЗаполнено(значение) Тогда
		ЗаполнитьЗначенияСвойств(настройки, значение);
	КонецЕсли;
		
	Возврат настройки;
КонецФункции

#КонецОбласти

#Область Проверки

Функция ЭтоУзелДляОбменаПоСобытиям(Узел) Экспорт
	настройки = Настройки();
	Возврат (настройки.Узлы.Получить(Узел) <> Undefined);
КонецФункции

#КонецОбласти