#Область СервисныеПроцедурыФункции

Функция МассивИзКлючейСоответствия(знач парамСоответствие)
	результат = Новый Массив;
	Для Каждого элт Из парамСоответствие Цикл
		результат.Добавить(элт.Ключ);
	КонецЦикла;
	
	Возврат результат;
КонецФункции

#КонецОбласти

Функция ЭтоУзелДляОбменаПоСобытиям(Узел) Экспорт
	Возврат exch_ОбменДаннымиПовтИсп.ЭтоУзелДляОбменаПоСобытиям(Узел);
КонецФункции

Функция ПолучателиСообщенияСОбъектом(Получатели) Экспорт
	настройки = exch_ОбменДаннымиНастройки.Настройки();	
	узлыСобытийногоОбмена = Новый Массив;
	Для Каждого узел Из Получатели Цикл
		Если настройки.Узлы.Получить(узел) <> Неопределено Тогда
			узлыСобытийногоОбмена.Добавить(узел);
		КонецЕсли;
	КонецЦикла;
	
	Возврат узлыСобытийногоОбмена;
КонецФункции