#Область СервисныеПроцедурыФункции

Функция МассивИзКлючейСоответствия(знач парамСоответствие)
	результат = Новый Массив;
	Для Каждого элт Из парамСоответствие Цикл
		результат.Добавить(элт.Ключ);
	КонецЦикла;
	
	Возврат результат;
КонецФункции

#КонецОбласти

Функция ЭтоУзелДляОбменаПоСобытиям(Узел) Экспорт
	настройки = exch_ОбменДаннымиНастройки.Настройки();
	Возврат (настройки.Узлы.Получить(Узел) <> Undefined);
КонецФункции

Функция ПолучателиСообщенияСОбъектом(Получатели) Экспорт
	настройки = exch_ОбменДаннымиНастройки.Настройки();	
	узлыСобытийногоОбмена = Новый Массив;
	Для Каждого узел Из Получатели Цикл
		Если настройки.Узлы.Получить(узел) <> Неопределено Тогда
			узлыСобытийногоОбмена.Добавить(узел);
		КонецЕсли;
	КонецЦикла;
	
	Возврат узлыСобытийногоОбмена;
КонецФункции

//Проверка необходимости выполнять обмен по событию
Функция ВыполнятьОбменПоСобытию(Источник, Отказ = Ложь) Экспорт
	имяСвойсваУзлыПолучателиСобытия = exch_ОбменДаннымиНастройки.ИмяСвойстваУзлыПолучателиСобытия();
	Если Отказ 
		ИЛИ Источник.ДополнительныеСвойства.Свойство(имяСвойсваУзлыПолучателиСобытия) = Ложь			
		ИЛИ (
				ТипЗнч(Источник.ДополнительныеСвойства[имяСвойсваУзлыПолучателиСобытия]) = Тип("Массив")
			 	И Источник.ДополнительныеСвойства[имяСвойсваУзлыПолучателиСобытия].Количество() = 0
			 )
	Тогда
		Возврат Ложь;		
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ЭтоОбъектСсылочногоТипа(Объект) Экспорт
	ОбъектМетаданных = "";
    Попытка
    	ОбъектМетаданных = Объект.Метаданные();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат ЭтоМетаданныеСсылочногоТипа(ОбъектМетаданных);
    
КонецФункции

Функция ЭтоМетаданныеСсылочногоТипа(Метаданные) Экспорт
	ИмяОбъектаМетаданных = "";
    Попытка
    	ИмяОбъектаМетаданных = Метаданные.ПолноеИмя();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат exch_ОбменДаннымиПовтИсп.ЭтоМетаданныеСсылочногоТипаПовтИсп(ИмяОбъектаМетаданных);    
КонецФункции
